10/data/attachments/b7d806131d90fc57.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_2935d071-2063-4a52-a53a-1e27dd4dfeea</nif:username>
            <nif:friendToBeAdded>Wendy_together_Friend_60530_7</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>